/*
 * File    : inc/common/PvzCommon.h
 * Project :
 * Author  : ze00
 * Email   : zerozakiGeek@gmail.com
 * Date    : 2019-01-28
 * Module  :
 * License : MIT
 */
#ifndef INC_COMMON_PVZCOMMON_H
#define INC_COMMON_PVZCOMMON_H
#include "common/common.h"
#include <pthread.h>
#include <unistd.h>

enum BuiltinsCommand {
  GETVERSION,
  GETPID,
  GETBASE,
  GETSTATUS,
  GETSAVES,
  GETCORELIB,
  GETWAVE,
  GET_TOTAL_HITPOINT,
  GET_HITPOINT_BOUNDARY,
  GET_TOTAL_FRESH_COUNTDOWN,
  GET_FRESH_COUNTDOWN,
};

enum fieldTypes {
  DAY,
  NIGHT,
  POOL,
  FOG,
  ROOF,
  MOONNIGHT,
  MUSHROOM_GARDEN,
  GARDEN,
};

struct PvzPoint {
  int x;
  int y;
};

class Communicator;
typedef void (*normal_callback)(Communicator *, msgPack *);
typedef void (*object_callback)(Communicator *, void *);
typedef void (*daemon_callback)(Communicator *);

static const char *cardsCodesMap[] = {
    "豌豆射手", "向日葵",     "樱桃炸弹",   "坚果",          "土豆地雷",
    "寒冰射手", "食人花",     "双发射手",   "小喷菇",        "阳光菇",
    "大喷菇",   "墓碑吞噬者", "迷惑菇",     "胆小菇",        "冰冻菇",
    "毁灭菇",   "睡莲",       "窝瓜",       "三线射手",      "海藻",
    "火爆辣椒", "地刺",       "火炬树桩",   "高坚果",        "海蘑菇",
    "灯笼草",   "仙人掌",     "三叶草",     "双向射手",      "杨桃",
    "南瓜套",   "磁力菇",     "卷心菜投手", "花盆",          "玉米投手",
    "咖啡豆",   "大蒜",       "叶子保护伞", "金盏花",        "西瓜投手",
    "机枪豌豆", "双子向日葵", "忧郁蘑菇",   "猫尾草",        "冰冻西瓜",
    "吸金瓷",   "地刺王",     "玉米大炮",   "模仿者",        "爆炸坚果",
    "巨型坚果", "树苗",       "反双发射手", [55] = "炸弹坑", "换植物卡",
    "阳光",     "钻石",       "潜水僵尸",   "奖杯",          [61] = "普通僵尸",
    "路障僵尸", "撑杆僵尸",   "铁桶僵尸",   "梯子僵尸",      "矿工僵尸",
    "蹦极僵尸", "橄榄球僵尸", "气球僵尸",   "铁门僵尸",      "冰车僵尸",
    "跳跳僵尸", "舞王僵尸",   "巨人僵尸",   "小鬼僵尸",
};

static const char *gamesCodesMap[] = {
    "冒险",
    "白天生存模式 (5面旗帜)",
    "黑夜生存模式 (5面旗帜)",
    "泳池生存模式 (5面旗帜)",
    "浓雾生存模式 (5面旗帜)",
    "屋顶生存模式 (5面旗帜)",
    "白天生存模式 (10面旗帜)",
    "黑夜生存模式 (10面旗帜)",
    "泳池生存模式 (10面旗帜)",
    "浓雾生存模式 (10面旗帜)",
    "屋顶生存模式 (10面旗帜)",
    "白天无尽",
    "黑夜无尽",
    "泳池无尽",
    "浓雾无尽",
    "屋顶无尽",
    "植物僵尸",
    "坚果保龄球",
    "老虎机",
    "雨中种植物",
    "宝石迷阵",
    "隐形食脑者",
    "看星星",
    "僵尸水族馆",
    "宝石迷阵转转看",
    "小僵尸大麻烦",
    "保护传送门",
    "你看.他们像柱子一样",
    "雪橇区",
    "僵尸快跑",
    "锤僵尸",
    "谁笑到最后",
    "植物僵尸2",
    "坚果保龄球2",
    "跳跳舞会",
    "僵王博士的复仇",
    "当艺术遇上坚果",
    "晴天",
    "不毛之地",
    "重要时间",
    "当艺术遇上向日葵",
    "空袭",
    "急冻先锋",
    "休闲花园",
    "超乎寻常的压力",
    "坟墓危险",
    "你能找到它吗",
    "暴风雨之夜",
    "飞贼闪电战",
    "松鼠",
    "花瓶终结者",
    "1路向左",
    "第3个花瓶",
    "连锁反应",
    "金属狂潮",
    "胆怯的陶制工",
    "戏法时刻",
    "连锁反应2",
    "破坏之王",
    "花瓶终结者(无限)",
    "僵尸公敌",
    "僵尸公敌2",
    "地道战",
    "完全防御",
    "死亡气球",
    "力拔山河",
    "太空舞步",
    "飞檐走壁",
    "你所有的大脑都是属于我的",
    "僵尸公敌(无限)",
    "追加销售",
    "白天1-1(快速关)",
    "白天1-2(快速关)",
    "白天1-3(快速关)",
    "白天1-4(快速关)",
    "白天1-5(快速关)",
    "白天1-6(快速关)",
    "白天1-7(快速关)",
    "白天1-8(快速关)",
    "白天1-9(快速关)",
    "白天1-10(快速关)",
    "黑夜2-1(快速关)",
    "黑夜2-2(快速关)",
    "黑夜2-3(快速关)",
    "黑夜2-4(快速关)",
    "黑夜2-5(快速关)",
    "黑夜2-6(快速关)",
    "黑夜2-7(快速关)",
    "黑夜2-8(快速关)",
    "黑夜2-9(快速关)",
    "黑夜2-10(快速关)",
    "泳池3-1(快速关)",
    "泳池3-2(快速关)",
    "泳池3-3(快速关)",
    "泳池3-4(快速关)",
    "泳池3-5(快速关)",
    "泳池3-6(快速关)",
    "泳池3-7(快速关)",
    "泳池3-8(快速关)",
    "泳池3-9(快速关)",
    "泳池3-10(快速关)",
    "迷雾4-1(快速关)",
    "迷雾4-2(快速关)",
    "迷雾4-3(快速关)",
    "迷雾4-4(快速关)",
    "迷雾4-5(快速关)",
    "迷雾4-6(快速关)",
    "迷雾4-7(快速关)",
    "迷雾4-8(快速关)",
    "迷雾4-9(快速关)",
    "迷雾4-10(快速关)",
    "屋顶5-1(快速关)",
    "屋顶5-2(快速关)",
    "屋顶5-3(快速关)",
    "屋顶5-4(快速关)",
    "屋顶5-5(快速关)",
    "屋顶5-6(快速关)",
    "屋顶5-7(快速关)",
    "屋顶5-8(快速关)",
    "屋顶5-9(快速关)",
    "屋顶5-10(快速关)",
    "谁笑到最后(白天)",
    "谁笑到最后(黑夜)",
    "谁笑到最后(泳池)",
    "谁笑到最后(迷雾)",
    "谁笑到最后(屋顶)",
    "谁笑到最后泳池(无限)",
    "Com2",
    "R",
};

static const char *zombiesCodesMap[] = {
    "普通",   "旗帜", "路障", "撑杆",   "铁桶", "读报", "铁栅门",
    "橄榄球", "舞王", "伴舞", "鸭子",   "潜水", "冰车", "雪橇",
    "海豚",   "小丑", "气球", "矿工",   "跳跳", "雪人", "蹦极",
    "扶梯",   "篮球", "白眼", "小鬼",   "僵博", "豌豆", "坚果",
    "辣椒",   "机枪", "窝瓜", "高坚果", "红眼"};

static const char *fieldsCodesMap[] = {"白天", "黑夜", "泳池",   "雾夜",
                                       "屋顶", "月夜", "蘑菇园", "花园"};
#endif // INC_COMMON_PVZCOMMON_H
